{
    "MENU": {
        "Home page": "Página inicial",
        "Getting started": "Primeiros passos",
        "Arenas": "Arenas",
        "Robots": "Robôs",
        "Programming": "Programação"
    },
    "HOME": {
        "Welcome to the official <span class=\"logo-bold\">sBotics</span> tutorial!": "Bem Vindo ao tutorial Oficial <span class=\"logo-bold\">sBotics</span>!",
        "the guide written and maintained by the developers and users.": "o guia escrito e mantido pelos desenvolvedores e usuários da comunidade.",
        "If you have any suggestions, create a pull request or open an issue on": "Se você tiver alguma sugestão, crie um pull request ou abra uma issue no ",
        "Guides": "Guias",
        "Getting started": "Começando",
        "Your first line-follower in rEduc": "Seu primeiro seguidor de linha no rEduc",
        "Importing/Exporting programs": "Programas de importação / exportação",
        "Importing/Exporting textures": "Importando / Exportando texturas",
        "Importing/Exporting arenas": "Importando / Exportando arenas",
        "Creating your own theme": "Criando seu próprio tema",
        "Contact us": "Contate-Nos",
        "Feedback form": "Formulário de feedback"
    },
    "GUIDE": {
        "GETTING_STARTED": {
            "Getting started": "Primeiros passos",
            "guide:getting started": "guia:primeiros passos",
            "Table of contents": "Índice",
            "Installing the program": "Instalando o programa",
            "Configuring launcher": "Configurando o iniciador",
            "Authentication": "Autenticação",
            "Generating new arena": "Gerando nova arena",
            "Choosing robot": "Escolhendo robô",
            "Choosing a programming language": "Escolha de uma linguagem de programação",
            "Which language to choose": "Qual idioma escolher",
            "Next steps": "Próximos passos",
            "To install sBotics you'll have to download our launcher in our": "Para instalar o sBotics, você terá que baixar o seu launcher em nosso",
            "official website": "website oficial",
            "Skip to": "Pule para",
            "We are currently experimenting with full MacOS launcher support, and thus sadly the simulator has to be redownloaded manually each and every update. First download the application from our": "No momento, estamos testando o suporte completo para o iniciador MacOS e, portanto, infelizmente, o simulador deve ser baixado manualmente a cada atualização. Primeiro baixe o aplicativo de nosso",
            "<kbd>Click</kbd>": "<kbd>Clique</kbd>",
            "the file and press \"open\"": "o arquivo e pressione \"abrir\"",
            "And voilà, the simulator is now open": "E olha só!, o simulador está aberto agora",
            "On linux open the terminal after downloading sBotics, ": "No Linux, abra o terminal depois de baixar o sBotics, ",
            "to the download folder and execute the following commands": "para a pasta de download e execute os seguintes comandos",
            "Then, exceute the AppImage": "Então, exceda o AppImage",
            "After opening the launcher select your language on the settings menu.": "Depois de abrir o iniciador, selecione seu idioma no menu de configurações.",
            "Click update to download the simulator's files.": "Clique em atualizar para baixar os arquivos do simulador.",
            "Click play to open the simulator.": "Clique em play para abrir o simulador.",
            "Authenticate using the Person icon": "Autenticar usando o ícone de pessoa",
            "After authentication you can program and use most of the simulator's features. If you don't have an account you can create one using": "Após a autenticação, você pode programar e usar a maioria dos recursos do simulador. Se você não tem uma conta, pode criar uma usando",
            "our website": "nosso site",
            "Open the simulation settings on the sidebar": "Abra as configurações de simulação na barra lateral",
            "Now open the arena settings as shown below in the simulation settings' sidebar": "Agora abra as configurações da arena como mostrado abaixo na barra lateral de configurações de simulação",
            "Now click on \"generate new arena\" in one of the desired arena formats to create a new arena. You can also change the difficulty and a few small tweaks from this screen": "Agora clique em \"gerar nova arena\" em um dos formatos de arena desejados para criar uma nova arena. Você também pode alterar a dificuldade e alguns pequenos ajustes nesta tela ",
            "Now use the arrow buttons to navigate through the": "Agora use os botões de seta para navegar pelo",
            "robots": "robôs",
            "and its actuators": "e seus atuadores",
            "You can learn more about the robots in our": "Você pode aprender mais sobre os robôs na nossa",
            "robots page": "página de robôs",
            "To choose a programing language open the programming panel present in the sidebar": "Para escolher uma lingugagem de programação abra o painel de programação presente na barra lateral",
            "Now wait for your programs to load and click the \"rE\", \"C#\" or Blockly symbol on the right sidebar, seen below as \"C#\".": "Agora espere seus programas carregarem e clique no símbolo de \"rE\", \"C#\" ou Blockly",
            "The language you are currently programming is shown below in a small green text": "A linguagem que você está programando atualmente é mostrada abaixo em um pequeno texto verde",
            "Which programming language to choose?": "Qual linguagem de programação escolher?",
            "The simulator currently offers two programming languages: rEduc and C#. It is possible to program rEduc in a text-based environment such as ": "Atualmente o simulador oferece duas linguagens de programação: rEduc e C#. É possível programar em ambas usando um editor de texto como o ",
            "<a href=\"https://code.visualstudio.com/\">visual studio code</a> as well as in blockly (using our software called BlockEduc).": "<a href=\"https://code.visualstudio.com/\"> visual studio code </a> assim como no blocky (usando o nosso software chamado BlockEduc)",
            "rEduc is simple and intuitive, and having the possibility to program in blocks as well as text makes it the preferable option to most users familiar with LEGO kits. C# offers more options such as Threads and access to more advanced functionalities and variables of the robot, but is slightly more complicated and its syntax harder than rEduc.<br/>We <b>personally</b> recommend rEduc for programming: it is simple, intuitive, easy to read and will be sufficient for most of the user's needs.": "O rEduc é simples e intuitivo, e ter a possibilidade de programar em blocos e também em texto o torna a opção preferível para a maioria dos usuários familiarizados com os kits LEGO. C# oferece mais opções como Threads e acesso a funcionalidades e variáveis ​​mais avançadas do robô, mas é um pouco mais complicado e sua sintaxe mais difícil do que rEduc. <br/> Nós <b>pessoalmente</b> recomendamos o rEduc para programação: ele é simples, intuitivo, fácil de ler e será suficiente para a maioria das necessidades do usuário.",
            "However, if you already have experience in another programming language, specially C++, Java or C, C# can also be an option for you as rEduc may be \"limiting\" for your needs.": "No entanto, se você já tem experiência em outra linguagem de programação, especialmente C++, Java ou C, C# também pode ser uma opção para você, pois o rEduc pode ser \"limitante\" para suas necessidades.",
            "Another advantage of programming using text is the support for external editors through our import/export code feature.<br/>There are a couple of snippets for rEduc/C# however our community is developing an API-based extension for VSCode and Sublime Text that will update with the simulator.": "Outra vantagem de programar usando texto é o suporte para editores externos por meio de nosso recurso de importação/exportação de código. <br/> Existem alguns snippets para rEduc/C#, no entanto, nossa comunidade está desenvolvendo uma extensão baseada em API para VSCode e Sublime Text que irá atualizar com o simulador.",
            "The sky 's the limit!": "O céu é o limite!",
            "start experimenting with the simulator and its features and you'll certainly find yourself better with time. Feel free to develop your own external solutions to your problems as long as they dont interact directly with the simulator. Want to program in python? What about a python transpilation program? Below, an example of a solution made by one of our users to better visualize what their robot was perceiving of the rescue zone (using the simulator 's write-to-text-file feature).": "comece a experimentar o simulador e seus recursos e você certamente ficará melhor com o tempo. Sinta-se à vontade para desenvolver suas próprias soluções externas para seus problemas, desde que não interajam diretamente com o simulador. Quer programar em python? Que tal um programa de transpilação python? Abaixo, um exemplo de uma solução feita por um de nossos usuários para melhor visualizar o que seu robô estava percebendo da zona de resgate (usando o recurso de gravação em arquivo de texto do simulador).",
            "<b>Next guide:</b> <a href=\"line_follower.html\">Your first line-follower in rEduc</a>.": "<b>Próximo guia:</b> <a href=\"line_follower.html\">Seu primeiro seguidor de linha no rEduc</a>.",
            "Don't forget to join our": "Não se esqueça de se juntar ao nosso",
            "<a href=\"https://discord.gg/PubzWWjzuz\">discord server</a>! We have many helpers and you can talk with the developers directly!": "<a href=\"https://discord.gg/PubzWWjzuz\">servidor discord</a>! Temos muitos ajudantes e você pode falar com os desenvolvedores diretamente!"
        },
        "LINE_FOLLOWER": {
            "Your first line follower in rEduc": "Seu primeiro seguidor de linha em rEduc",
            "guide:line_follower": "guia:seguidor de linha",
            "If you want to know the basic features of the simulator, you may want to read our <a href=\"getting_started.html\">getting started</a> tutorial.": "Se você quiser conhecer os recursos básicos do simulador, dê uma olhada no nosso tutorial de <a href=\"getting_started.html\">primeiros passos</a>.",
            "After authenticating and choosing your favorite robot to make the line follower you'll have to create your first program. For this tutorial I'll be using Rescuelance, the first and default robot.": "Após fazer o login e escolher seu robô favorito para se tornar o seguuidor de linha, você terá que criar seu primeiro programa. Para esse tutorial, usaremos o Robô 1, que é o padrão.",
            "Now take a look at the robot tab to see the sensors and their indexes. As you can see from the image below, the right sensor has the index 1 and the left sensor has 2.": "Agora dê uma olhada na aba do robô para ver os sensores e seus índices. Como você pode ver na imagem abaixo, o sensor direito tem o índice 1, e o esquerdo índice 2.",
            "Now open the programming tab and make sure you are programming in rEduc (this is shown below the first time you open the tab or change languages)": "Abra a aba de programação e certifique-se que está programando em rEduc (isso é mostrado embaixo na primeira vez que você abre essa aba ou troca de idioma):",
            "Now let's make a simple program. To test, execute this very simple program that should make the robot move forward with strength value 60": "Vamos começar com um programa simples. Para testar, execute o código abaixo que deve fazer o robô avançar com 60 de velocidade:",
            "As you can see, this didn't move the robot forward at all. And if it actually did, it was only for 1 milisecond. For the robot to move forward for <i>a period of time</i> instead of a fraction of a second, the state of the motor has to stay put for a while. In this case, we will use the <code>wait(number)</code> function.": "Como você pode ver, isso não moveu o robô para frente. E se moveu, foi apenas por 1 milissegundo. Para que o robô avance por <i>um período de tempo</i> em vez de uma fração de segundo, o estado do motor deve permanecer por um tempo. Para isso usaremos a função <code> esperar(numero) </code>",
            "As you can see, the robot moved for 2 seconds (or 2000 miliseconds) before stopping the program.": "Agora sim! O robô moveu por 2 segundos (o equivalente a 2000 milissegundos) antes de finalizar o programa.",
            "In order to make a line-follower the program has to repeat itself indefinitely (that is, as long as the program is being executed). To do this we will be creating a simple loop using while.": "Para se tornar um seguidor de linha, o programa deve ficar se repetindo. Para fazer isso usamos um ciclo (loop) simples usando enquanto.",
            "The code above will repeat itself indefinitely, and it literally reads as": "O código abaixo vai se repetir indefinidamente, e é literalmente lido como",
            "\"while the condition \"true\" is true, do\"": "\"enquanto a condição \"verdadeiro\" for verdadeira, farei\"",
            "Now let's move the robot forward.": "Agora vamos fazer o robô ir para frente.",
            "<br>Now let's move the robot forward.": "<br>Agora vamos mover o robô para frente.",
            "The code above will run the robot forward (for 1 milisecond) indefinitely.": "O código abaixo vai fazer o robô andar para frente (por 1 milissegundo), mas ficará se repetindo pois está dentro do loop",
            "Now let's read the color values seen by each sensor using the <code>write</code> function. Let's print the right sensor's value on the first console line and the left sensor's on the second.": "Agora vamos ler os valores de cor vistos por cada sensor, usando a função <code>escrever</code>. Vamos escrever o valor do sensor da direita na primeira linha do console, e o da esquerda na segunda.",
            "To open the console window, click on the \"terminal\" icon present in the left sidebar": "Para abrir a janela do console, clique no ícone de \"terminal\" na barra da esquerda",
            "As you can see, the sensor sees different color values and prints them on the console. Now we can use this to our advantage.": "Como você pode ver, o sensor lê cores diferentes e as escreve no console. Agora podemos usar isso a nosso favor.",
            "With a simpler arena this time, let's make the robot turn turn right when the right sensor (1) perceives": "Com uma arena mais simples dessa vez, vamos fazer o robô virar à direita quando o sensor direito (1) ler",
            "\"BLACK\". To do this, we will use the conditional if. <br /><b>Note!</b> Moving sideways causes more friction and the strength of the motors may have to be raised in contrast to their forward/backwards counterparts.": " \"PRETO\". Para fazer isso, usaremos a condicional <code>se</code> <br /><b>Atenção!</b> Se mover lateralmente causa mais atrito e a força dos motores pode ter que ser aumentada em contraste com o movimento para frente/trás",
            "If you wish to use variables to store the color values and make your code slightly more efficient you can do so this way": "Se você quiser usar variáveis para armazenar os valores de cor e fazer se código ligeiramente mais eficiente, você pode fazer dessa maneira",
            "As you can see, now the robot follows the line (although only forwards and on right turns)": "Como você pode ver, agora o robô segue a linha (embora apenas para frente e em curvas para a direita)",
            "<code>color()</code> can be limiting, specially if you want to calibrate your robot to different lighting setttings. The same code above can be rewritten with <code>light</code> as:<br /><b>Tip!</b> Try making auto-calibration algorithms. ": "O comando <code>cor()</code> pode ser limitante, especialmente se você quer calibrar seu robô para diferentes condições de luz. O mesmo código acima pode ser reescrito com <code>luz</code>: <br /><b>Dica!</b> Tente criar algorítimos de auto-calibração. ",
            "Depending on the \"time of day \" the robot can stop functioning altogether due to poor calibration.": "Dependendo da \"hora do dia\", o roô pode parar de funcionar completamente devido a uma calibração errada.",
            "Now it's up to you to make a complete line-follower and more complex algorithms.": "Agora depende de você criar um seguidor de linha completo com algoritmos mais complexos!",
            "Experiment with sBotics and join our <a href=\"https://discord.gg/PubzWWjzuz \">community on discord</a>. There are loads of people there that would like to help you in your journey.": "Experimente o sBotics e junte-se à nossa <a href=\"https://discord.gg/PubzWWjzuz \">comunidade no discord</a>! Há muitas pessoas lá que adorariam te ajudar nessa jornada!",
            "If you wish to view all rEduc or C# functions, <a href=\"https://sbotics.weduc.natalnet.br/functions\">click here</a>.": "Se você quiser ver todas as funções do rEduc, <a href=\"https://sbotics.weduc.natalnet.br/functions\">clique aqui</a>."
        }
    },
    "ARENAS": {
        "INDEX": {
            "Arenas": "Arenas",
            "Tiles": "Ladrilhos",
            "Editor": "Editor",
            "Code": "Código"
        },
        "MESSAGE_WARNING": {
            "<div class=\"alertinputcamp hidden\"></div>": "<div class=\"alert alert-danger alert-dismissible fade show\" role=\"alert\"><strong>AVISO!</strong> O tutorial de Arenas em portugues ainda não foi traduzido. Tradução em breve!<button type=\"button\" class=\"close\" data-dismiss=\"alert\" aria-label=\"Close\"><span aria-hidden=\"true\">&times;</span></button></div>"
        }
    },
    "ROBOTS": {
        "INDEX": {
            "Robots": "Robôs",
            "Behavior": "Comportamento",
            "Rescuelance": "",
            "SPC-Rover": "",
            "Firetrekker": "",
            "Toybot": "",
            "RoboTruck": "",
            "Sensors": "Sensores"
        },
        "BEHAVIOR": {
            "Behavior": "Comportamento",
            "robots:behavior": "robôs:comportamento",
            "Table of contents": "Índice",
            "Weight and speed": "Peso e velocidade",
            "Bot controller": "Controlador de bot",
            "IO": "",
            "Console": "",
            "LED": "",
            "Sensors": "Sensores",
            "Weight is a property present in all robots. It governs how fast the robots move and how efficient they're able to climb slopes. Usually, the bigger and more sensors any given robot has, the heavier it will be, forcing users to make a compromise between accuracy (of their readings) and speed. The weight values of each robot are present in their respective pages.": "O peso é uma propriedade presente em todos os robôs. Ele rege a velocidade com que os robôs se movem e a eficiência com que são capazes de subir encostas. Normalmente, quanto maiores e mais sensores um determinado robô tiver, mais pesado ele será, forçando os usuários a fazer um compromisso entre a precisão (de suas leituras) e a velocidade. Os valores de peso de cada robô estão presentes em suas respectivas páginas.",
            "Bot controller (or bc) is the class that controls the virtual robot inside the simulator. Commands usually use the bc class instance.": "Controlador de bot (ou bc) é a classe que controla o robô virtual dentro do simulador. Os comandos geralmente usam a instância da classe bc.",
            "<strong>Example: </strong><code>bc.wait(1000);</code>": "<strong>Exemplo: </strong><code>bc.wait(1000);</code>",
            "Below are listed three ways information can be passed or shown to/by the robot.": "Abaixo estão listadas três maneiras pelas quais as informações podem ser passadas ou mostradas para/pelo robô.",
            "The console can be found on the sidebar menu, and all values printed to it will be shown there.": "O console pode ser encontrado no menu da barra lateral, e todos os valores impressos nele serão mostrados lá.",
            "The LED is a RGB light located at the top of the robot. The user can light one of the basic color values (\"WHITE\", \"BLACK\", \"YELLOW\", \"MAGENTA\", \"GREEN\", \"BLUE\", \"CYAN\", \"RED\") or a customizable RGB value from 0 to 255.": "O LED é uma luz RGB localizada na parte superior do robô. O usuário pode acender um dos valores básicos de cor (\"BRANCO\", \"PRETO\", \"AMARELO\", \"MAGENTA\", \"VERDE\", \"AZUL\", \"CIANO\", \"VERMELHO\") ou um valor RGB personalizável de 0 a 255.",
            "Sensors are the only input components for the bot controller, and are further described <a href=\"sensors.html\">here</a>.": "Sensores são os únicos componentes de entrada para o controlador de bot, e são descritos mais detalhadamente  <a href=\"sensors.html\">aqui</a>."
        },
        "ACTUATORS": {
            "Actuators": "Atuadores",
            "robots:actuators": "robôs:atuadores",
            "Work in progress": "Trabalho em progresso"
        },
        "CUSTOMIZATION": {
            "Customization": "Costumização",
            "robots:customization": "robôs:costumização",
            "Robot customization is a work in progress feature, currently half-completed and should be implemented in the next several updates.": "A personalização do robô é um recurso de trabalho em andamento, atualmente concluído pela metade e deve ser implementado nas próximas atualizações."
        },
        "SENSORS": {
            "Sensors": "Sensores",
            "robots:sensors": "robôs:sensores",
            "Sensors are capable of perceiving the environment around the robot and returning the detected values.": "Os sensores são capazes de perceber o ambiente ao redor do robô e retornar os valores detectados.",
            "Table of contents": "Índice",
            "Light-color sensor": "Sensor de cor clara",
            "Touch sensor": "Sensor de toque",
            "Ultrasonic sensor": "Sensor ultrasônico",
            "Built-in sensors": "Sensores integrados",
            "Compass": "Bússola",
            "Gyroscope": "Giroscópio",
            "Temperature": "Temperatura",
            "The light/color sensor is capable of perceiving, as the name implies, light and color. Its functionality is determined by a reading of a 10x10 image to determine what color or light value is being read.": "O sensor de luz/cor é capaz de perceber, como o nome indica, luz e cor. Sua funcionalidade é determinada pela leitura de uma imagem 10x10 para determinar qual cor ou valor de luz está sendo lido.",
            "The touch sensor is capable of perceiving touch and returning a boolean.": "O sensor de toque é capaz de perceber o toque e retornar um booleano.",
            "The ultrasonic sensor is capable of perceiving distance by projecting raycasts forward in a triangular shape.": "O sensor ultrassônico é capaz de perceber distâncias projetando raios-raios para a frente em uma forma triangular.",
            "All <a href=\"behavior.html#bc\">bot controllers</a> regardless of the robot have built-in sensors, such as": "Todos os <a href=\"behavior.html#bc\">controladores de bot</a>, independentemente do robô, têm sensores integrados, como",
            "The compass sensor returns a value from 0 to 359 of the robot's perceived position.": "O sensor da bússola retorna um valor de 0 a 359 da posição percebida do robô.",
            "The gyroscope returns the perceived robot inclination.": "O giroscópio retorna a inclinação percebida do robô.",
            "Returns the perceived heat. Candles and Live Victims.": "Retorna o calor percebido. Velas e vítimas vivas."
        },
        "RESCUELANCE": {
            "Rescuelance": "",
            "robots:rescuelance": "robôs:rescuelance",
            "Rescuelance is one of the five preset robots present on the simulator. It consists of 3 color sensors (where two are down-facing).": "O Rescuelance é um dos cinco robôs predefinidos presentes no simulador. É composto por 3 sensores de cor (sendo dois voltados para baixo).",
            "Table of contents": "Índice",
            "Notes": "Notas",
            "Trivia": "Curiosidades",
            "Feel like expanding this article? Suggest your own texts and changes on github or ": "Quer expandir este artigo? Sugira seus próprios textos e mudanças no github ou em ",
            "<a href=\"https://discord.gg/PubzWWjzuz\">our discord server</a>": "<a href=\"https://discord.gg/PubzWWjzuz\">nosso servidor discord</a>",
            "The name comes from its default texture: A \"Rescue Ambulance\"": "O nome vem de sua textura padrão: A \"Ambulância de resgate \"",
            "The number 193 in its sides are a reference to Brazil's emergency services number.": "O número 193 nas laterais é uma referência ao número do serviço de emergência do Brasil.",
            "Info.": "Informações.",
            "Weight": "Peso",
            "LED(s)": "",
            "Light/color sensor(s)": "Sensor(es) de luz/cor",
            "Refresh rate": "Taxa de atualização",
            "Buzzer(s)": "Alto falante(s)",
            "Touch sensor(s)": "Sensor(es) de toque",
            "Ultrasonic sensor(s)": "Sensor(es) ultrassônico",
            "Actuators": "Atuadores",
            "Bulldozer": "",
            "Forklift": "Empilhadeira",
            "Reduced range forklift": "empilhadeira de alcance reduzido",
            "Frontal forklift": "Empilhadeira frontal",
            "Rear bulldozer": "bulldozer traseiro"
        },
        "SPC-ROVER": {
            "SPC-Rover": "Astromóvel",
            "robots:spc_rover": "robôs:astromóvel",
            "SPC-Rover is one of the five preset robots present on the simulator. It consists of 6 color sensors (where five are down-facing).": "SPC-Rover é um dos cinco robôs predefinidos presentes no simulador. É composto por 6 sensores de cor (cinco estão voltados para baixo).",
            "Table of contents": "Índice",
            "Notes": "Notas",
            "Trivia": "Curiosidades",
            "Feel like expanding this article? Suggest your own texts and changes on github or <a href=\"https://discord.gg/PubzWWjzuz\">our discord server</a>": "Quer expandir este artigo? Sugira seus próprios textos e mudanças no github ou em <a href=\"https://discord.gg/PubzWWjzuz\">nosso servidor discord</a>",
            "The name derives from \"Space Rover\"": "O nome deriva de \"Astromóvel\"",
            "This robot was originally designed as a military autonomous vehicle": "Este robô foi originalmente projetado como um veículo militar autônomo",
            "The symbol on its rear texture refers to the <a href=\"https://en.wikipedia.org/wiki/Brazilian_Space_Agency\">Brazilian Space Agency</a>": "O símbolo em sua textura traseira se refere à <a href=\"https://en.wikipedia.org/wiki/Brazilian_Space_Agency\">Agência Espacial Brasileira</a>",
            "Info.": "Informações.",
            "Weight": "Peso",
            "LED(s)": "",
            "Light/color sensor(s)": "Sensor(es) de luz/cor",
            "Refresh rate": "Taxa de atualização",
            "Buzzer(s)": "Alto falante(s)",
            "Touch sensor(s)": "Sensor(es) de toque",
            "Ultrasonic sensor(s)": "Sensor(es) ultrassônico",
            "Actuators": "Atuadores",
            "Bulldozer": "",
            "Forklift": "Empilhadeira",
            "Reduced range forklift": "empilhadeira de alcance reduzido",
            "Frontal forklift": "Empilhadeira frontal",
            "Rear bulldozer": "bulldozer traseiro"
        },
        "FIRETREKKER": {
            "Firetrekker": "",
            "robots:firetrekker": "robôs:firetrekker",
            "Firetrekker is one of the five preset robots present on the simulator. It consists of 5 color sensors (where four are down-facing).": "Firetrekker é um dos cinco robôs predefinidos presentes no simulador. É composto por 5 sensores de cor (quatro estão voltados para baixo).",
            "Table of contents": "Índice",
            "Notes": "Notas",
            "Trivia": "Curiosidades",
            "Feel like expanding this article? Suggest your own texts and changes on github or <a href=\"https://discord.gg/PubzWWjzuz\">our discord server</a>": "Quer expandir este artigo? Sugira seus próprios textos e mudanças no github ou em <a href=\"https://discord.gg/PubzWWjzuz\">nosso servidor discord</a>",
            "The name is a play on \"Fire truck\"": "O nome é uma brincadeira com \"Caminhão de bombeiros\"",
            "Info.": "Informações.",
            "Weight": "Peso",
            "LED(s)": "",
            "Light/color sensor(s)": "Sensor(es) de luz/cor",
            "Refresh rate": "Taxa de atualização",
            "Buzzer(s)": "Alto falante(s)",
            "Touch sensor(s)": "Sensor(es) de toque",
            "Ultrasonic sensor(s)": "Sensor(es) ultrassônico",
            "Actuators": "Atuadores",
            "Bulldozer": "",
            "Forklift": "Empilhadeira",
            "Reduced range forklift": "empilhadeira de alcance reduzido",
            "Frontal forklift": "Empilhadeira frontal",
            "Rear bulldozer": "bulldozer traseiro"
        },
        "TOYBOT": {
            "Toybot": "",
            "robots:toybot": "robôs:toybot",
            "Toybot is one of the five preset robots present on the simulator. It consists of 3 color sensors (where two are down-facing). It is the fastest robot and quite possibly the most complicated to program.": "Toybot é um dos cinco robôs predefinidos presentes no simulador. É composto por 3 sensores de cor (sendo dois voltados para baixo). É o robô mais rápido e possivelmente o mais complicado de programar.",
            "Table of contents": "Índice",
            "Notes": "Notas",
            "Trivia": "Curiosidades",
            "Feel like expanding this article? Suggest your own texts and changes on github or <a href=\"https://discord.gg/PubzWWjzuz\">our discord server</a>": "Quer expandir este artigo? Sugira seus próprios textos e mudanças no github ou em <a href=\"https://discord.gg/PubzWWjzuz\">nosso servidor discord</a>",
            "The colors on the robot's texture are supposed to represent Brazil.": "As cores na textura do robô deveriam representar o Brasil.",
            "Info.": "Informações.",
            "Weight": "Peso",
            "LED(s)": "",
            "Light/color sensor(s)": "Sensor(es) de luz/cor",
            "Refresh rate": "Taxa de atualização",
            "Buzzer(s)": "Alto falante(s)",
            "Touch sensor(s)": "Sensor(es) de toque",
            "Ultrasonic sensor(s)": "Sensor(es) ultrassônico",
            "Actuators": "Atuadores",
            "Bulldozer": "",
            "Forklift": "Empilhadeira",
            "Reduced range forklift": "empilhadeira de alcance reduzido",
            "Frontal forklift": "Empilhadeira frontal",
            "Rear bulldozer": "bulldozer traseiro"
        },
        "ROBOTRUCK": {
            "RoboTruck": "",
            "robots:robotruck": "robôs:robotruck",
            "RoboTruck is one of the five preset robots present on the simulator. It consists of 6 color sensors (where five are down-facing).": "RoboTruck é um dos cinco robôs predefinidos presentes no simulador. Consiste em 6 sensores de cor (cinco estão voltados para baixo).",
            "Table of contents": "Índice",
            "Notes": "Notas",
            "Trivia": "Curiosidades",
            "Feel like expanding this article? Suggest your own texts and changes on github or <a href=\"https://discord.gg/PubzWWjzuz\">our discord server</a>": "Quer expandir este artigo? Sugira seus próprios textos e mudanças no github ou em <a href=\"https://discord.gg/PubzWWjzuz\">nosso servidor discord</a>",
            "The name is a play on \"Robot Truck\"": "O nome é uma brincadeira com \"Caminhão Robô\"",
            "Info.": "Informações.",
            "Weight": "Peso",
            "LED(s)": "",
            "Light/color sensor(s)": "Sensor(es) de luz/cor",
            "Refresh rate": "Taxa de atualização",
            "Buzzer(s)": "Alto falante(s)",
            "Touch sensor(s)": "Sensor(es) de toque",
            "Ultrasonic sensor(s)": "Sensor(es) ultrassônico",
            "Actuators": "Atuadores",
            "Bulldozer": "",
            "Forklift": "Empilhadeira",
            "Reduced range forklift": "empilhadeira de alcance reduzido",
            "Frontal forklift": "Empilhadeira frontal",
            "Rear bulldozer": "bulldozer traseiro"
        }
    },
    "PROGRAMMING": {
        "Programming": "Programação",
        "Coming soon": "Em breve"
    }
}